---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteInSketch
source: html/e81d9b0b-7a07-ef3b-59af-90aebcb285cd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteInSketch Property

Can't paste elements into sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPasteInSketch { get; }
```